Revit 2024 API
ElementFilter Methods
The ElementFilter type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
PassesFilter(Element)
 Applies the filter to a given element.
PassesFilter(Document, ElementId)
 Applies the filter to a given element.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ElementFilter Class
Autodesk.Revit.DB Namespace